'''8. Посчитать, сколько раз встречается определенная цифра в введенной последовательности чисел.
Количество вводимых чисел и цифра, которую необходимо посчитать, задаются вводом с клавиатуры.'''

dig = int(input("Какую цифру считаем? "))
num = int(input("Сколько чисел будете вводить? "))
counter = 0
for i in range(num):
    x = int(input("Введите {}/{} число ".format(i+1,num)))
    while x:
        counter += 1 if x % 10 == dig else 0
        x //= 10
print("Удалось насчитать ", counter)