'''6. В программе генерируется случайное целое число от 0 до 100. Пользователь должен его отгадать не более чем за 10 попыток.
После каждой неудачной попытки должно сообщаться, больше или меньше загаданного введенное пользователем число.
Если за 10 попыток число не отгадано, то вывести его.'''

import random

x = random.randint(0,100)

for i in range(10):
    num = int(input("Угадайте число "))
    if num < x:
        print("Загаданное число больше")
    elif num > x:
        print("Загаданное число меньше")
    else:
        print("Угадано!")
        break
else:
    print("Попытки кончились!")