'''5. Вывести на экран коды и символы таблицы ASCII, начиная с символа под номером 32 и заканчивая 127-м включительно.
Вывод выполнить в табличной форме: по десять пар «код-символ» в каждой строке.'''

st = '{}:"{}"'.format(32, chr(32))
for i in range(33,128):
    st += ', {}:"{}"'.format(i, chr(i))
    if i % 10 == 1:
        print(st)
        st = '{}:"{}"'.format(i, chr(i))
print(st)