'''7. Написать программу, доказывающую или проверяющую,
что для множества натуральных чисел выполняется равенство: 1+2+...+n = n(n+1)/2, где n – любое натуральное число.'''

while True:
    answer = input("Вы верите в равенство 1+2+..n = n(n+1)/2 для любого натурального n? ")
    if answer.lower() == "да":
        break
    num = int(input("Введите n на котором равенство не будет верно "))
    left = 0
    right = 0
    for i in range(num):
        left += i + 1
    right = int((i+1) * (i + 2) / 2)
    print("Левая часть равна {}, а правая {}".format(left,right))
