'''4. Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125, ... Количество элементов (n) вводится с клавиатуры.'''

num = int(input("Введите число элементов в ряду "))

mlt = 1
result = 0
for i in range(num):
    result += mlt
    mlt *= -0.5
print(result)