'''1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
Числа и знак операции вводятся пользователем. После выполнения вычисления программа не должна завершаться,
а должна запрашивать новые данные для вычислений.
Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.
Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'),
то программа должна сообщать ему об ошибке и снова запрашивать знак операции.
Также сообщать пользователю о невозможности деления на ноль, если он ввел 0 в качестве делителя.'''

while True:
    cmd = input("Введите операцию или 0 для завершения ")
    if cmd == '0':
        print("Goodbye!")
        break
    a = float(input("Введите первое число "))
    b = float(input("Введите второе число "))
    if cmd == '+':
        print('a + b = ', a + b)
    elif cmd == '-':
        print('a - b = ', a - b)
    elif cmd == '/':
        if b:
            print('a / b = ', a / b)
        else:
            print('На ноль делить нельзя!')
    elif cmd == '*':
        print('a * b = ', a * b)
    else:
        print('Неизвестная операция')
