'''5. Пользователь вводит две буквы. Определить, на каких местах алфавита они стоят и сколько между ними находится букв.'''

c1 = input('Введите первую букву ').strip()
c2 = input('Введите вторую букву ').strip()

print('Первая буква на {} месте в алфавите'.format(ord(c1) - ord('a') + 1))
print('Вторая буква на {} месте в алфавите'.format(ord(c2) - ord('a') + 1))
print('Расстояние между буквами = ' + str(abs(ord(c1) - ord(c2))))