'''4. Написать программу, которая генерирует в указанных пользователем границах:
случайное целое число;
случайное вещественное число;
случайный символ. Для каждого из трех случаев пользователь задает свои границы диапазона. Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы. Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.'''
import random

low = int(input("Введите левую границу для генерации целого числа "))
high = int(input("Введите правую границу для генерации целого числа. Граница не должна быть меньше левой "))
print("Random integer " + str(random.randint(low, high)))

low = float(input("Введите левую границу для генерации вещественного числа "))
high = float(input("Введите правую границу для генерации вещественного числа. Граница не должна быть меньше левой "))
print("Random float " + str(low + random.random() * (high - low)))

low = int(ord(input("Введите левую границу для генерации символа ").strip()))
high = int(ord(input("Введите правую границу для генерации символа. Граница не должна быть меньше левой ").strip()))
print("Random char " + chr(random.randint(low, high)))
