'''7. По длинам трех отрезков, введенных пользователем, определить возможность существования треугольника, составленного из этих отрезков.
Если такой треугольник существует, то определить, является ли он разносторонним, равнобедренным или равносторонним.'''

len1 = float(input('Введите длину первого отрезка (положительное вещественное число) '))
len2 = float(input('Введите длину второго отрезка (положительное вещественное число) '))
len3 = float(input('Введите длину третьего отрезка (положительное вещественное число) '))

if len1 >= len2 + len3 or len2 >= len1 + len3 or len3 >= len1 + len2:
    print('Треугольника с такими сторонами быть не может')
elif len1 == len2 and len2 == len3:
    print('Это равносторонний треугольник')
elif len1 == len2 or len2 == len3:
    print('Это равнобедренный треугольник')
else:
    print('Это разносторонний треугольник')