'''8. Определить, является ли год, который ввел пользователем, високосным или невисокосным.'''

y = int(input('Введите год '))

if not(y % 400) or (y % 100 and not (y % 4)):
    print('Високосный год!')
else:
    print('Невисокосный год!')
